Tekla Open API Reference for Tekla Structures 2025
SectionMarkBase.SectionMarkTagsAttributes Constructor (SectionMarkBase.SectionMarkTagAttributes, SectionMarkBase.SectionMarkTagAttributes, SectionMarkBase.SectionMarkTagAttributes, SectionMarkBase.SectionMarkTagAttributes, SectionMarkBase.SectionMarkTagAttributes)
 Creates a new mark tags attributes instance.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public SectionMarkTagsAttributes(
	SectionMarkBase.SectionMarkTagAttributes tagA1,
	SectionMarkBase.SectionMarkTagAttributes tagA2,
	SectionMarkBase.SectionMarkTagAttributes tagA3,
	SectionMarkBase.SectionMarkTagAttributes tagA4,
	SectionMarkBase.SectionMarkTagAttributes tagA5
)
Public Sub New (
	tagA1 As SectionMarkBase.SectionMarkTagAttributes,
	tagA2 As SectionMarkBase.SectionMarkTagAttributes,
	tagA3 As SectionMarkBase.SectionMarkTagAttributes,
	tagA4 As SectionMarkBase.SectionMarkTagAttributes,
	tagA5 As SectionMarkBase.SectionMarkTagAttributes
)
Parameters
tagA1
Type: Tekla.Structures.Drawing.SectionMarkBase.SectionMarkTagAttributes
The tag at place A1.
tagA2
Type: Tekla.Structures.Drawing.SectionMarkBase.SectionMarkTagAttributes
The tag at place A2.
tagA3
Type: Tekla.Structures.Drawing.SectionMarkBase.SectionMarkTagAttributes
The tag at place A3.
tagA4
Type: Tekla.Structures.Drawing.SectionMarkBase.SectionMarkTagAttributes
The tag at place A4.
tagA5
Type: Tekla.Structures.Drawing.SectionMarkBase.SectionMarkTagAttributes
The tag at place A5.
See Also
Reference
SectionMarkBase.SectionMarkTagsAttributes Class
SectionMarkBase.SectionMarkTagsAttributes Overload
Tekla.Structures.Drawing Namespace